20260129T213544--kdoc-539-『「レベルアップ」のゲームデザイン』__draft_book.org
:properties:
:ID: 20260129T213544
:end:
#+title:      KDOC 539: 『「レベルアップ」のゲームデザイン』
#+date:       [2026-01-29 Thu 21:35]
#+filetags:   :draft:book:
#+identifier: 20260129T213544

#+begin_comment
(kd/denote-kdoc-rename)
(kd/denote-format)

====ポリシー。
1ファイル1アイデア。
1ファイルで内容を完結させる。
常にほかのエントリとリンクする。
自分の言葉を使う。
参考文献を残しておく。
文献メモの場合は、感想と混ぜないこと。1つのアイデアに反する
ツェッテルカステンの議論に寄与するか。それで本を書けと言われて書けるか
頭のなかやツェッテルカステンにある問いとどのようにかかわっているか
エントリ間の接続を発見したら、接続エントリを追加する。カード間にあるリンクの関係を説明するカード。
アイデアがまとまったらアウトラインエントリを作成する。リンクをまとめたエントリ。
エントリを削除しない。古いカードのどこが悪いかを説明する新しいカードへのリンクを追加する。
恐れずにカードを追加する。無意味の可能性があっても追加しておくことが重要。
個人の感想・意思表明ではない。事実や書籍情報に基づいている

====永久保存メモのルール。
自分の言葉で書く。
後から読み返して理解できる。
他のメモと関連付ける。
ひとつのメモにひとつのことだけを書く。
メモの内容は1枚で完結させる。
論文の中に組み込み、公表できるレベルである。

====水準を満たす価値があるか。
その情報がどういった文脈で使えるか。
どの程度重要な情報か。
そのページのどこが本当に必要な部分なのか。
公表できるレベルの洞察を得られるか

====フロー。
1. 「走り書きメモ」「文献メモ」を書く
2. 1日1回既存のメモを見て、自分自身の研究、思考、興味にどのように関係してくるかを見る
3. 追加すべきものだけ追加する

#+end_comment

* この文書のステータス
- 作成
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))
- レビュー
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))

# チェックリスト ================
# 関連をつけた。
# タイトルがフォーマット通りにつけられている。
# 内容をブラウザに表示して読んだ(作成とレビューのチェックは同時にしない)。
# 文脈なく読めるのを確認した。
# おばあちゃんに説明できる。
# いらない見出しを削除した。
# タグを適切にした。
# すべてのコメントを削除した。
* 概要
# 本文(見出しも設定する)

なし。

* メモ

- 音を経由してプレイヤーに届く情報はとても多い。1度サウンドが加わるとゲームに命が吹き込まれるので、仮のサウンドエフェクトでもまず入れておくことが重要である(p19)
- アイデアを仕入れたいときにすること(p26)
  - いつもなら絶対に読まないものを読む
  - 散歩する、運転する、シャワーを浴びる
  - セミナー(GDCなど)に出席する
  - 出来の悪いゲームをプレイする。よいゲームよりも、出来の悪いゲームを遊ぶほうがずっと役立つ。自分ならどう向上させるか考える
  - 自分の情熱に従う。田尻智は昆虫採集の情熱にゲームに活かしてポケットモンスターをデザインした
- よいゲームは、プレイヤーの願望を叶えてくれる。現実世界ではなれないものを体験できるのがゲームである。アイデアを温めている段階で、「このゲームのターゲットは誰か」を明確にする(p31)
- 「おもしろくないの理論」: 「おもしろい」と考えるアイデアから作り始め、過程でおもしろくないものを見つけたらそれを取り除く。すべてのおもしろくない要素を取り除ければ、おもしろいものだけが残っているはず。最初におもしろいアイデアが必要である(p33)
- アイデアのリストができあがったら、いいアイデアだけ残し、それ以外は捨てる。アイデアに愛着を持たない。残ったアイデアを、ほかの人に話してみる。宮本茂「奥さんメーター」という仕組みを持っていて、アイデアを奥さんに話して反応を見るという。普段アイデアに興味を持たない人ほど、正直な意見を教えてくれる(p38)
- ゲームストーリーについて、3タイプのユーザがいる(p48)
  - 展開したストーリーを単純に受け入れるタイプ
  - ストーリーにのめり込み、深い部分を知りたいタイプ
  - ストーリーにまったく興味を示さないタイプ
- ゲームのストーリーを考えるときには「何が危険にさらされているか」を考える(p50)
- Game Design Documentの例(p77)
- GDDはとにかくゲームプレイを重視する。キャラクターと世界の関係でなく、キャラクターがどのように世界にインタラクトするかが焦点である。他の関係者に伝えるための文書はGDDの肉付けのあとに書く(p78)
- 記憶喪失のキャラクターというのはテレビゲームでもっとも古いステレオタイプの1つであり、ゲーマーが引いてしまうので避けたほうがよい。夢オチと同じくらい悪印象(p80)
- キャラクターをデザインするうえでのルール: 外見はゲームデザインに合わせる。性格の特徴を、キャラクターの身体的特徴として取り入れる(p87)
- リンクはゲーム業界でもっとも好かれているキャラクターの1人だが、すべてのシリーズでリンクの名前を変更できるようになっている。どんなことでもキャラクターをカスタマイズできれば親近感が増す(p93)
- ほとんどのテレビゲームキャラクターは背後から見られるので、動きを表現するものを背中に付けることが重要である(95)
- 開発期間中ずっと男の尻を凝視するのは嫌だという理由から、トゥームレイダーで主役を女性にしたエピソードがある(p134)
- テレビゲームでの赤十字は回復系アイテムのことである(p185)
- ストーリーはゲームのレベル内で語られるべきである。空間を使ってストーリーを語ることは、建築デザインで何世紀も使われてきた。テーマパークのガイドマップは参考になる。テーマパークは効果的な方法で1つの冒険から次の冒険へとゲストを移動させるようにデザインされている(p212)
- ビートチャートは映画作成を助けるツールである(p218)
  - レベル名
  - ファイル名
  - プレイヤーの目標
  - ストーリービート
  - プレイスタイル
  - 敵
  - メカニクス
  - NPC
  - ボーナス要素
  - 時刻(時間帯)、天候
  - 色づかい
- 指状の脇道は世界をより深く満ちたものに感じさせる。また、すべての脇道の終わりに報酬を配置すべき(p231)
- 遠距離バトルのリズムの構築では、レベルデザインこそがゲームデザインである。長い回廊と一発の致命的なダメージは用心深いプレイになる(p269)
- ゲームデザイナーは難しくて相手にするのが疲れるような敵でもプレイヤーが戦いたいと考えるように努力するべきである。ライフをリスクにさらしても悪い奴らと戦うことに利点があると伝える(p296)
  - 戦利品、通路を閉鎖、鍵の所持
- 高難易度: 苦痛と損失を与えるもの。チャレンジ: スキルと工夫を促すもの(p336)
- サウンドには近距離音、遠距離音、優先音を用意して不協和音を防ぐ(p401)

* 関連
# 関連するエントリ。書いているファイルから見て、なぜ関連させたか書く。意味のあるつながりを意識的につくる。
# [引用、整合性、どう説明できるか、矛盾、補っているか、以前聞いたこと、対立、修正、補足、付け加え、組み合わせ、疑問]
# また、現在はリンクが見つからなくてもこういった切り口で将来関連させられそうな項目を書いておく
# [類推、未解決、具体例、追加調査、理由、動機、検証]
# 横に類推するか、上に抽象化するか、下に具体化するか

なし。
