20260129T213544--kdoc-539-『「レベルアップ」のゲームデザイン』__draft_book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-02-14T18:31:23Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 539: 『「レベルアップ」のゲームデザイン』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 539: 『「レベルアップ」のゲームデザイン』</h1>
<div id="outline-container-org3668070" class="outline-2">
<h2 id="org3668070"><a href="#org3668070">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org3668070">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc48b61f" class="outline-2">
<h2 id="orgc48b61f"><a href="#orgc48b61f">概要</a></h2>
<div class="outline-text-2" id="text-orgc48b61f">
<p>
なし。
</p>
</div>
</div>
<div id="outline-container-orge855038" class="outline-2">
<h2 id="orge855038"><a href="#orge855038">メモ</a></h2>
<div class="outline-text-2" id="text-orge855038">
<ul class="org-ul">
<li>音を経由してプレイヤーに届く情報はとても多い。1度サウンドが加わるとゲームに命が吹き込まれるので、仮のサウンドエフェクトでもまず入れておくことが重要である(p19)</li>
<li>アイデアを仕入れたいときにすること(p26)
<ul class="org-ul">
<li>いつもなら絶対に読まないものを読む</li>
<li>散歩する、運転する、シャワーを浴びる</li>
<li>セミナー(GDCなど)に出席する</li>
<li>出来の悪いゲームをプレイする。よいゲームよりも、出来の悪いゲームを遊ぶほうがずっと役立つ。自分ならどう向上させるか考える</li>
<li>自分の情熱に従う。田尻智は昆虫採集の情熱にゲームに活かしてポケットモンスターをデザインした</li>
</ul></li>
<li>よいゲームは、プレイヤーの願望を叶えてくれる。現実世界ではなれないものを体験できるのがゲームである。アイデアを温めている段階で、「このゲームのターゲットは誰か」を明確にする(p31)</li>
<li>「おもしろくないの理論」: 「おもしろい」と考えるアイデアから作り始め、過程でおもしろくないものを見つけたらそれを取り除く。すべてのおもしろくない要素を取り除ければ、おもしろいものだけが残っているはず。最初におもしろいアイデアが必要である(p33)</li>
<li>アイデアのリストができあがったら、いいアイデアだけ残し、それ以外は捨てる。アイデアに愛着を持たない。残ったアイデアを、ほかの人に話してみる。宮本茂「奥さんメーター」という仕組みを持っていて、アイデアを奥さんに話して反応を見るという。普段アイデアに興味を持たない人ほど、正直な意見を教えてくれる(p38)</li>
<li>ゲームストーリーについて、3タイプのユーザがいる(p48)
<ul class="org-ul">
<li>展開したストーリーを単純に受け入れるタイプ</li>
<li>ストーリーにのめり込み、深い部分を知りたいタイプ</li>
<li>ストーリーにまったく興味を示さないタイプ</li>
</ul></li>
<li>ゲームのストーリーを考えるときには「何が危険にさらされているか」を考える(p50)</li>
<li>Game Design Documentの例(p77)</li>
<li>GDDはとにかくゲームプレイを重視する。キャラクターと世界の関係でなく、キャラクターがどのように世界にインタラクトするかが焦点である。他の関係者に伝えるための文書はGDDの肉付けのあとに書く(p78)</li>
<li>記憶喪失のキャラクターというのはテレビゲームでもっとも古いステレオタイプの1つであり、ゲーマーが引いてしまうので避けたほうがよい。夢オチと同じくらい悪印象(p80)</li>
<li>キャラクターをデザインするうえでのルール: 外見はゲームデザインに合わせる。性格の特徴を、キャラクターの身体的特徴として取り入れる(p87)</li>
<li>リンクはゲーム業界でもっとも好かれているキャラクターの1人だが、すべてのシリーズでリンクの名前を変更できるようになっている。どんなことでもキャラクターをカスタマイズできれば親近感が増す(p93)</li>
<li>ほとんどのテレビゲームキャラクターは背後から見られるので、動きを表現するものを背中に付けることが重要である(95)</li>
<li>開発期間中ずっと男の尻を凝視するのは嫌だという理由から、トゥームレイダーで主役を女性にしたエピソードがある(p134)</li>
<li>テレビゲームでの赤十字は回復系アイテムのことである(p185)</li>
<li>ストーリーはゲームのレベル内で語られるべきである。空間を使ってストーリーを語ることは、建築デザインで何世紀も使われてきた。テーマパークのガイドマップは参考になる。テーマパークは効果的な方法で1つの冒険から次の冒険へとゲストを移動させるようにデザインされている(p212)</li>
<li>ビートチャートは映画作成を助けるツールである(p218)
<ul class="org-ul">
<li>レベル名</li>
<li>ファイル名</li>
<li>プレイヤーの目標</li>
<li>ストーリービート</li>
<li>プレイスタイル</li>
<li>敵</li>
<li>メカニクス</li>
<li>NPC</li>
<li>ボーナス要素</li>
<li>時刻(時間帯)、天候</li>
<li>色づかい</li>
</ul></li>
<li>指状の脇道は世界をより深く満ちたものに感じさせる。また、すべての脇道の終わりに報酬を配置すべき(p231)</li>
<li>遠距離バトルのリズムの構築では、レベルデザインこそがゲームデザインである。長い回廊と一発の致命的なダメージは用心深いプレイになる(p269)</li>
<li>ゲームデザイナーは難しくて相手にするのが疲れるような敵でもプレイヤーが戦いたいと考えるように努力するべきである。ライフをリスクにさらしても悪い奴らと戦うことに利点があると伝える(p296)
<ul class="org-ul">
<li>戦利品、通路を閉鎖、鍵の所持</li>
</ul></li>
<li>高難易度: 苦痛と損失を与えるもの。チャレンジ: スキルと工夫を促すもの(p336)</li>
<li>サウンドには近距離音、遠距離音、優先音を用意して不協和音を防ぐ(p401)</li>
</ul>
</div>
</div>
<div id="outline-container-orgdc26543" class="outline-2">
<h2 id="orgdc26543"><a href="#orgdc26543">関連</a></h2>
<div class="outline-text-2" id="text-orgdc26543">
<p>
なし。
</p>
</div>
</div>
<div id="outline-container-org550da22" class="outline-2">
<h2 id="org550da22"><a href="#org550da22">Backlinks</a></h2>
<div class="outline-text-2" id="text-org550da22">
<ul class="org-ul">
<li><a href="./20260203T224157--kdoc-543-出来の悪いゲームのほうが参考になる__draft_essay.html">KDOC 543: 出来の悪いゲームのほうが参考になる</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
